FKDD_COPY_DIFF_3_2026-02-14/DataProcessors/смсТестВебСервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>смсТестВебСервиса</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
					<Comment>Получатели</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Comment>Номер телефона</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстСообщения</Name>
							<Comment>Текст сообщения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗавершения</Name>
							<Comment>Дата завершения</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Comment>Описание ошибки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GUID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>38</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.смсСостоянияСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Входящие</Name>
					<Comment>Получатели</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отправитель</Name>
							<Comment>Отправитель</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Comment>Получатель</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстСообщения</Name>
							<Comment>Текст сообщения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПолучения</Name>
							<Comment>Дата получения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Comment>Описание ошибки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GUID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>38</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/DataProcessors/смсТестВебСервиса/Forms/ФормаУправляемая/Ext/Form/Module.bsl
// ТЕСТОВАЯ ОБРАБОТКА WEB-СЕРВИСА

///////////////////////////////////////////////
//  ВСПОМОГАТЕЛЬНЫЕ МЕТОДЫ
&НаКлиенте
Функция ПолучитьВремяСМС()
	
	Попытка
		scrptCtrl= Новый COMОбъект("MSScriptControl.ScriptControl");
		scrptCtrl.language="jscript";
		scrptCtrl.addcode("
		|function GetMilliseconds()
		|{
		|d = new Date();
		|return(d.getHours() + "":"" + d.getMinutes() + "":"" + d.getSeconds()+""."" + d.getMilliseconds());
		|}
		|");
		Возврат scrptCtrl.run("GetMilliseconds");
	Исключение
		Возврат ТекущаяДата();
	КонецПопытки;

КонецФункции

&НаКлиенте
Процедура СгенерироватьСМС(Команда)
	Если КолвоСтрок = 0 Тогда
		Возврат;
	КонецЕсли; 	
	
	Если ПустаяСтрока(ОбщийТекст) Тогда
		Предупреждение(НСтр("ru = 'Не введен текст сообщения'"));
		Возврат;
	КонецЕсли; 	
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	
	Если ОчищатьТаблицу Тогда
		Объект.Получатели.Очистить();
	КонецЕсли;
	
	НачКолвоСтрок = Объект.Получатели.Количество();
	Для ин = 1 По КолвоСтрок Цикл
		Строка = Объект.Получатели.Добавить();
		// снегерим несуществующий номер (код "907" не может быть у реальных номеров)
		ЧисловойНомер = ГСЧ.СлучайноеЧисло(0, 9999999);
		СтроковыйНомер = Строка(ЧисловойНомер);
		НомерТелефона = СтрЗаменить(СтроковыйНомер, Символы.НПП, ""); 
		НомерПолучателя = "7908" + Лев("0000000", 7 - СтрДлина(НомерТелефона)) + НомерТелефона;
		Строка.НомерТелефона = НомерПолучателя;
		Если НЕ ИспользоватьОбщийТекст Тогда
			Строка.ТекстСообщения = ОбщийТекст + (ин + НачКолвоСтрок);
		КонецЕсли;
		Строка.GUID = Новый УникальныйИдентификатор;
		Строка.ДатаОтправки = ТекущаяДата();
		Строка.Статус = ПредопределенноеЗначение("Перечисление.смсСостоянияСообщений.Доставка");
	КонецЦикла; 
КонецПроцедуры

Процедура ОбновитьСтатус()
	Элементы.Подключиться.ЦветФона = ЦветаСтиля.ЦветФонаКнопки;
	СтрокаСтатус = "Подключено";
	КодСессии = смсКоммуникатор.ПолучитьНомерСессии();
КонецПроцедуры

///////////////////////////////////////////////
//  ОБРАБОТЧИКИ ВЫЗОВА МЕТОДЫ ЯДРА

&НаКлиенте
Процедура Подключиться(Команда)
    
    Сообщить("----------------------------------------------------------------------"); 
	Сообщить(НСтр("ru = 'Метод ""Подключиться()"": Начало выполнения = " + ПолучитьВремяСМС()+"'")); 
	КодОшибки = смсКоммуникатор.Подключиться();
	Если КодОшибки < 0 Тогда
		Сообщить(НСтр("ru = 'Действие не выполнено! " + смсКоммуникатор.ОписаниеОшибокВебСервиса(КодОшибки) + "(" + КодОшибки + ")'"));
	КонецЕсли; 
	Сообщить(НСтр("ru = 'Метод ""Подключиться()"": Конец выполнения  = " + ПолучитьВремяСМС()+"'")); 
	Если КодОшибки > 0 Тогда
		ПараметрыСессии(Команда);
		ОбновитьСтатус();
    КонецЕсли; 
    
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСессии(Команда)
    
    ПараметрыСессии = Новый Структура;
	
	Сообщить("----------------------------------------------------------------------"); 
	Сообщить(НСтр("ru = 'Метод ""ПолучитьПараметрыСессии()"": Начало выполнения = " + ПолучитьВремяСМС()+"'")); 
	КодОшибки = смсКоммуникатор.ПолучитьПараметрыСессии(ПараметрыСессии);
	Если КодОшибки < 0 Тогда
		Сообщить(НСтр("ru = 'Действие не выполнено! " + смсКоммуникатор.ОписаниеОшибокВебСервиса(КодОшибки) + "(" + КодОшибки + ")'"));
	КонецЕсли; 
	Сообщить(НСтр("ru = 'Метод ""ПолучитьПараметрыСессии()"": Конец выполнения  = " + ПолучитьВремяСМС()+"'")); 
	
	Если КодОшибки > 0 Тогда
		
		СмещениеUTC = "" + ПараметрыСессии.СмещениеUTC + " сек. (" + Окр(ПараметрыСессии.СмещениеUTC/60/60) + "ч)";
		КолвоСМС 	= ПараметрыСессии.ОстатокСМС;
		
		Элементы.НомерОтправителя.СписокВыбора.Очистить();
		Для каждого Номер Из смсКоммуникатор.ПолучитьСписокНомеровИзСтроки(ПараметрыСессии.Номера) Цикл
			Элементы.НомерОтправителя.СписокВыбора.Добавить(Номер);
		КонецЦикла; 
		
		Если НЕ ЗначениеЗаполнено(Элементы.НомерОтправителя.СписокВыбора[0].Значение) Тогда
			Элементы.НомерОтправителя.СписокВыбора.Удалить(0);
		КонецЕсли; 
		
		НомерОтправителя = Элементы.НомерОтправителя.СписокВыбора[0].Значение;
		
		ОбновитьСтатус();
		
    КонецЕсли; 
    
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСообщения(Команда)
    
    СписокСообщений = Новый Массив;
	
	Сообщить("----------------------------------------------------------------------"); 
	Сообщить(НСтр("ru = 'Метод ""ПолучитьСообщения()"": Начало выполнения = " + ПолучитьВремяСМС()+"'")); 
	КодОшибки = смсКоммуникатор.ПолучитьСообщения(СписокСообщений, ДатаВх,, Флажок1);
	Если КодОшибки < 0 Тогда
		Сообщить(НСтр("ru = 'Действие не выполнено! " + смсКоммуникатор.ОписаниеОшибокВебСервиса(КодОшибки) + "(" + КодОшибки + ")'"));
	КонецЕсли; 
	Сообщить(НСтр("ru = 'Метод ""ПолучитьСообщения()"": Конец выполнения  = " + ПолучитьВремяСМС()+"'")); 
	
	Если КодОшибки > 0 Тогда
		Объект.Входящие.Очистить();
		Для каждого Строка Из СписокСообщений Цикл
			НовСтрока = Объект.Входящие.Добавить();
			НовСтрока.Получатель  = Строка.Получатель;
			НовСтрока.GUID 		  = Строка.GUID;
			НовСтрока.Отправитель = Строка.Отправитель;
			НовСтрока.ДатаПолучения  = Строка.ДатаПолучения;
			НовСтрока.ТекстСообщения  = Строка.ТекстСообщения;
		КонецЦикла; 
		
		Элементы.ТаблЧасти.ТекущаяСтраница = Элементы.ТаблЧасти.ПодчиненныеЭлементы.ГруппаВходящие;
		КолвоВходСМС = Объект.Входящие.Количество();
		
		ОбновитьСтатус();
    КонецЕсли; 
    
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщения(Команда)
    
    Если ИспользоватьОбщийТекст и ПустаяСтрока(ОбщийТекст) Тогда
		Сообщить(НСтр("ru = 'Укажите общий текст сообщения!'")); 
		Возврат;
	КонецЕсли; 	
	
	СписокСообщений = Новый Массив;
	Для каждого Строка Из Объект.Получатели Цикл
		Структура = Новый Структура;
		Структура.Вставить("GUID",    Строка.GUID);
		Структура.Вставить("НомерПолучателя", Строка.НомерТелефона);
		Структура.Вставить("ТекстСообщения",  Строка.ТекстСообщения);
		Структура.Вставить("КодОшибки", 0);
		СписокСообщений.Добавить(Структура);
	КонецЦикла; 
	
	Сообщить("----------------------------------------------------------------------"); 
	Сообщить(НСтр("ru = 'Метод ""ОтправитьСообщения()"": Начало выполнения = " + ПолучитьВремяСМС()+"'")); 
	КодОшибки = смсКоммуникатор.ОтправитьСообщения(СписокСообщений, Строка(НомерОтправителя), ?(ИспользоватьОбщийТекст, ОбщийТекст, ""), ДатаОтправки, ДатаЗавершения,,,);
	//
	Если КодОшибки < 0 Тогда
		Сообщить(НСтр("ru = 'Действие не выполнено! " + смсКоммуникатор.ОписаниеОшибокВебСервиса(КодОшибки) + "(" + КодОшибки + ")'"));
	КонецЕсли; 
	Сообщить(НСтр("ru = 'Метод ""ОтправитьСообщения()"": Конец выполнения  = " + ПолучитьВремяСМС()+"'")); 
	
	Если КодОшибки > 0 Тогда
		Для Каждого Строка Из СписокСообщений Цикл
			Если Строка.КодОшибки > 0 Тогда
				Структура = Новый Структура();
				Структура.Вставить("GUID",Строка.GUID);
				ИскомыеСтроки = Объект.Получатели.НайтиСтроки(Структура);
				Если ИскомыеСтроки.Количество()>0 Тогда
					ИскомыеСтроки[0].Статус = ПредопределенноеЗначение("Перечисление.смсСостоянияСообщений.ВОчереди");
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла; 
		ОбновитьСтатус();
    КонецЕсли; 
    
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусы(Команда)
    
    СписокСообщений = Новый Массив;
	Для каждого Строка Из Объект.Получатели Цикл
		Структура = Новый Структура;
		Структура.Вставить("GUID",   Строка.GUID);
		Структура.Вставить("СтатусСообщения", смсРаботаССообщениями.СтатусВКод(Строка.Статус));
		СписокСообщений.Добавить(Структура);
	КонецЦикла;
	Сообщить("----------------------------------------------------------------------"); 
	Сообщить(НСтр("ru = 'Метод ""ОбновитьСтатусы()"": Начало выполнения = " + ПолучитьВремяСМС()+"'")); 
	КодОшибки = смсКоммуникатор.ОбновитьСтатусы(СписокСообщений);
	
	Если КодОшибки < 0 Тогда
		Сообщить(НСтр("ru = 'Действие не выполнено! " + смсКоммуникатор.ОписаниеОшибокВебСервиса(КодОшибки) + "(" + КодОшибки + ")'"));
	КонецЕсли; 
	Сообщить(НСтр("ru = 'Метод ""ОбновитьСтатусы()"": Конец выполнения  = " + ПолучитьВремяСМС()+"'")); 
	
	Если КодОшибки > 0 Тогда
		Для Каждого Строка Из СписокСообщений Цикл
			Структура = Новый Структура();
			Структура.Вставить("GUID",Строка.GUID);
			Найдено = Объект.Получатели.НайтиСтроки(Структура);
			Если Найдено.Количество()>0 Тогда
				Если Число(?(ЗначениеЗаполнено(Строка.СтатусСообщения), Строка.СтатусСообщения, 0)) < 0 Тогда
					Найдено[0].Статус = смсРаботаССообщениями.КодВСтатус(7); 
					Найдено[0].ОписаниеОшибки = смсКоммуникатор.ОписаниеОшибокВебСервиса(Строка.СтатусСообщения);
				Иначе
					Найдено[0].Статус = смсРаботаССообщениями.КодВСтатус(Строка.СтатусСообщения);
					Найдено[0].ОписаниеОшибки = "";
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
		ОбновитьСтатус();
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура Отключиться(Команда)
    
    смсКоммуникатор.Отключиться();
	Элементы.Подключиться.ЦветФона = WebЦвета.Золотой;
	СтрокаСтатус = "Отключено";
	КодСессии = 0;
	СмещениеUTC = "";
	КолвоСМС = 0;
    
КонецПроцедуры

///////////////////////////////////////////////
//  ПРОЧИЕ ОБРАБОТЧИКИ 

&НаКлиенте
Процедура ПриЗакрытии()
    смсКоммуникатор.Отключиться();
КонецПроцедуры

&НаКлиенте
Процедура Транслитерировать(Команда)
    ОбщийТекст = смсКоммуникатор.Транслитерация(ОбщийТекст);
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.смсСостоянияСообщений.Доставка");
		Элемент.ТекущиеДанные.GUID	 = Новый УникальныйИдентификатор;
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоставку(Команда)
	Для Каждого Строка Из Объект.Получатели Цикл
		Строка.Статус = ПредопределенноеЗначение("Перечисление.смсСостоянияСообщений.Доставка");
		Строка.ОписаниеОшибки = "";
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаОтправки = ТекущаяДата();
    ОчищатьТаблицу = Истина;
КонецПроцедуры
